mdbsliguo/stm32_template_SPL/Drivers/can/can.c
/**
 * @file can.c
 * @brief CAN总线驱动模块实现
 * @version 1.0.0
 * @date 2024-01-01
 * @details 基于STM32标准外设库的CAN总线驱动，支持CAN1/2，标准帧/扩展帧，过滤器配置
 */

/* Include config.h first to get module enable flags */
#include "config.h"

#if CONFIG_MODULE_CAN_ENABLED

/* Include our header */
#include "can.h"

#include "gpio.h"
#include "delay.h"
#include "nvic.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_can.h"
#include "misc.h"
#include <stdbool.h>
#include <stddef.h>
#include <string.h>

/* 从board.h加载配置 */
static CAN_Config_t g_can_configs[CAN_INSTANCE_MAX] = CAN_CONFIGS;

/* 初始化标志 */
static bool g_can_initialized[CAN_INSTANCE_MAX] = {false, false};

/* 默认超时时间（毫秒） */
#define CAN_DEFAULT_TIMEOUT_MS  1000

/* 中断回调函数数组（支持12种中断类型） */
static CAN_IT_Callback_t g_can_it_callbacks[CAN_INSTANCE_MAX][12] = {NULL};
static void *g_can_it_user_data[CAN_INSTANCE_MAX][12] = {NULL};

/* 中断模式接收缓冲区 */
static CAN_Message_t g_can_rx_buffer[CAN_INSTANCE_MAX][2] = {0};  /* FIFO0和FIFO1 */
static bool g_can_rx_pending[CAN_INSTANCE_MAX][2] = {false};

/**
 * @brief 获取CAN外设时钟
 * @param[in] can_periph CAN外设指针
 * @return uint32_t 时钟使能值，失败返回0
 */
static uint32_t CAN_GetPeriphClock(CAN_TypeDef *can_periph)
{
    (void)can_periph;
    return 0;
}

/**
 * @brief 获取GPIO时钟
 * @param[in] port GPIO端口指针
 * @return uint32_t GPIO时钟使能值
 */
static uint32_t CAN_GetGPIOClock(GPIO_TypeDef *port)
{
    (void)port;
    return 0;
}

/**
 * @brief CAN初始化
 */
CAN_Status_t CAN_Init(CAN_Instance_t instance)
{
    /* 编译时警告 */
    #warning "CAN函数: 占位空函数，功能未实现，待完善"
    
    /* ⚠️ 占位空函数：功能未实现，待完善 */
    return CAN_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief CAN反初始化
 */
CAN_Status_t CAN_Deinit(CAN_Instance_t instance)
{
    /* 编译时警告 */
    #warning "CAN函数: 占位空函数，功能未实现，待完善"
    
    /* ⚠️ 占位空函数：功能未实现，待完善 */
    return CAN_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief CAN发送消息（阻塞式）
 */
CAN_Status_t CAN_Transmit(CAN_Instance_t instance, const CAN_Message_t *message, uint32_t timeout)
{
    /* 编译时警告 */
    #warning "CAN函数: 占位空函数，功能未实现，待完善"
    
    /* ⚠️ 占位空函数：功能未实现，待完善 */
    return CAN_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief CAN接收消息（阻塞式）
 */
CAN_Status_t CAN_Receive(CAN_Instance_t instance, CAN_Message_t *message, uint8_t fifo_number, uint32_t timeout)
{
    /* 编译时警告 */
    #warning "CAN函数: 占位空函数，功能未实现，待完善"
    
    /* ⚠️ 占位空函数：功能未实现，待完善 */
    return CAN_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief 检查是否有消息待接收
 */
uint8_t CAN_GetPendingMessageCount(CAN_Instance_t instance, uint8_t fifo_number)
{
    return 0;
}

/**
 * @brief 配置CAN过滤器
 */
CAN_Status_t CAN_ConfigFilter(CAN_Instance_t instance, uint8_t filter_number,
                               uint32_t filter_id, uint32_t filter_mask,
                               CAN_FrameType_t filter_type, uint8_t fifo_number)
{
    /* 编译时警告 */
    #warning "CAN函数: 占位空函数，功能未实现，待完善"
    
    /* ⚠️ 占位空函数：功能未实现，待完善 */
    return CAN_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief 检查CAN是否已初始化
 */
uint8_t CAN_IsInitialized(CAN_Instance_t instance)
{
    return 0;
}

/**
 * @brief 获取CAN外设指针
 */
CAN_TypeDef* CAN_GetPeriph(CAN_Instance_t instance)
{
    return NULL;
}

/* ========== 中断模式功能实现 ========== */

/**
 * @brief 获取CAN中断类型对应的SPL库中断值
 */
static uint32_t CAN_GetITValue(CAN_IT_t it_type)
{
    (void)it_type;
    return 0;
}

/**
 * @brief 获取CAN中断向量
 */
static void CAN_GetIRQn(CAN_Instance_t instance, IRQn_Type *tx_irqn, IRQn_Type *rx0_irqn, IRQn_Type *rx1_irqn, IRQn_Type *sce_irqn)
{
    (void)instance;
    (void)tx_irqn;
    (void)rx0_irqn;
    (void)rx1_irqn;
    (void)sce_irqn;
}

/**
 * @brief 使能CAN中断
 */
CAN_Status_t CAN_EnableIT(CAN_Instance_t instance, CAN_IT_t it_type)
{
    /* 编译时警告 */
    #warning "CAN函数: 占位空函数，功能未实现，待完善"
    
    /* ⚠️ 占位空函数：功能未实现，待完善 */
    return CAN_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief 禁用CAN中断
 */
CAN_Status_t CAN_DisableIT(CAN_Instance_t instance, CAN_IT_t it_type)
{
    /* 编译时警告 */
    #warning "CAN函数: 占位空函数，功能未实现，待完善"
    
    /* ⚠️ 占位空函数：功能未实现，待完善 */
    return CAN_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief 设置CAN中断回调函数
 */
CAN_Status_t CAN_SetITCallback(CAN_Instance_t instance, CAN_IT_t it_type,
                                CAN_IT_Callback_t callback, void *user_data)
{
    /* 编译时警告 */
    #warning "CAN函数: 占位空函数，功能未实现，待完善"
    
    /* ⚠️ 占位空函数：功能未实现，待完善 */
    return CAN_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief CAN非阻塞发送（中断模式）
 */
CAN_Status_t CAN_TransmitIT(CAN_Instance_t instance, const CAN_Message_t *message)
{
    /* 编译时警告 */
    #warning "CAN函数: 占位空函数，功能未实现，待完善"
    
    /* ⚠️ 占位空函数：功能未实现，待完善 */
    return CAN_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief CAN中断服务函数
 */
void CAN_IRQHandler(CAN_Instance_t instance, uint8_t fifo)
{
}

/* CAN中断服务程序入口 */
void USB_HP_CAN1_TX_IRQHandler(void)
{
    
}

void USB_LP_CAN1_RX0_IRQHandler(void)
{
    
}

void CAN2_RX0_IRQHandler(void)
{
    
}

void CAN2_RX1_IRQHandler(void)
{
    
}

void CAN2_SCE_IRQHandler(void)
{
    
}

/**
 * @brief 获取CAN最后错误码
 */
uint8_t CAN_GetInstanceLastErrorCode(CAN_Instance_t instance)
{
    return 0;
}

/**
 * @brief CAN总线恢复（从总线关闭状态恢复）
 */
CAN_Status_t CAN_Recovery(CAN_Instance_t instance)
{
    /* 编译时警告 */
    #warning "CAN函数: 占位空函数，功能未实现，待完善"
    
    /* ⚠️ 占位空函数：功能未实现，待完善 */
    return CAN_ERROR_NOT_IMPLEMENTED;
}

/* ========== CAN测试模式功能实现 ========== */

/**
 * @brief 获取CAN模式对应的SPL库模式值
 */
static uint8_t CAN_GetModeValue(CAN_Mode_t mode)
{
    (void)mode;
    return 0;
}

/**
 * @brief 配置CAN工作模式
 */
CAN_Status_t CAN_SetMode(CAN_Instance_t instance, CAN_Mode_t mode)
{
    /* 编译时警告 */
    #warning "CAN函数: 占位空函数，功能未实现，待完善"
    
    /* ⚠️ 占位空函数：功能未实现，待完善 */
    return CAN_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief 获取CAN当前工作模式
 */
CAN_Status_t CAN_GetMode(CAN_Instance_t instance, CAN_Mode_t *mode)
{
    /* 编译时警告 */
    #warning "CAN函数: 占位空函数，功能未实现，待完善"
    
    /* ⚠️ 占位空函数：功能未实现，待完善 */
    return CAN_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief 请求CAN操作模式
 */
CAN_Status_t CAN_RequestOperatingMode(CAN_Instance_t instance, CAN_OperatingMode_t op_mode)
{
    /* 编译时警告 */
    #warning "CAN函数: 占位空函数，功能未实现，待完善"
    
    /* ⚠️ 占位空函数：功能未实现，待完善 */
    return CAN_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief CAN进入睡眠模式
 */
CAN_Status_t CAN_Sleep(CAN_Instance_t instance)
{
    /* 编译时警告 */
    #warning "CAN函数: 占位空函数，功能未实现，待完善"
    
    /* ⚠️ 占位空函数：功能未实现，待完善 */
    return CAN_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief CAN从睡眠模式唤醒
 */
CAN_Status_t CAN_WakeUp(CAN_Instance_t instance)
{
    /* 编译时警告 */
    #warning "CAN函数: 占位空函数，功能未实现，待完善"
    
    /* ⚠️ 占位空函数：功能未实现，待完善 */
    return CAN_ERROR_NOT_IMPLEMENTED;
}

#endif /* CONFIG_MODULE_CAN_ENABLED */

